# определяем функцию
# def - ключевое слово
# add - имя функции
# x, y - аргументы функции

def add(x, y):
    return x + y


# вызываем функцию
add(1, 2)

# печатаем результат
print(add(1, 2))

print(add('i a', 'm tester'))


# аргументы c и d являются необязательными.
# заданое значение аргумента определяет тип переменной, его не изменить при вызове функции.
# значение необязательного аргумента не может быть изменяемым, например, списком.
# при определении функции сначала идут обязательные аргументы, потом необязательные
def arg(a, b, c=2, d=3):
    return a + b + c + d


print(arg(1, 1, 1, 1))
print(arg(2, 2))
# print(arg(2, 2, '1', 1))  # будет ошибка, потому что нельзя передавать изменяемое значение (строка)


def range_arg(a, b, c, d):
    return a + ' ' + b + ' ' + c + ' ' + d


print(range_arg('1', '2', '3', '4'))
print(range_arg('1', '2', d='3', c='4'))  # меняем порядок аргументов


def task_1(a=(1, 2, 3, 4)):
    return a[1]


def task_2(r, pi=3.14159):
    return pi * r ** 2
